'''
本文件用于定量的定义，以及打分模板的建立
author: white_mai
email: 18341491429@163.com
'''

best_point = [0, 0]  # AI下一步最应该下的位置
AItotal = []         # AI下过的点
Playertotal = []     # 玩家下过的点
Alltotal = []        # 所有下过的点
whole = []           # 整个棋盘的点
DEPTH = 3            # 搜索深度
width = 40           # 界面参数
high = 15            # 长
row = 15             # 宽
# 如果和下列棋形一样直接胜利
victory = [(1, 1, 1, 1, 0),
           (1, 1, 1, 0, 1),
           (1, 1, 0, 1, 1),
           (1, 0, 1, 1, 1),
           (0, 1, 1, 1, 1)]
# 如果和下列棋形一样展开攻击，连四
attack = [(0, 1, 1, 1, 0)]
# 如果和下列棋形一样防守
defense = [(0, 2, 2, 2, 2),
           (2, 2, 2, 2, 0),
           (2, 2, 2, 0, 2),
           (2, 2, 0, 2, 2),
           (2, 0, 2, 2, 2), ]
# 一般情况的打分板
table = [(10, (1, 1, 1, 0, -1)),        # 边界情况
         (10, (-1, 0, 1, 1, 1)),        # 边界情况
         (20, (0, 1, 1, 0, 0)),         # 活二
         (20, (0, 0, 1, 1, 0)),         # 活二
         (300, (0, 0, 1, 1, 1)),        # 死三
         (300, (1, 1, 1, 0, 0)),        # 死三
         (300, (1, 1, 0, 1, 0)),        # 死眠四
         (300, (0, 1, 0, 1, 1)),        # 死眠四
         (3000, (0, 1, 1, 1, 0)),       # 活三
         (3000, (0, 1, 0, 1, 1, 0)),    # 活眠四
         (3000, (0, 1, 1, 0, 1, 0)),    # 活眠四
         (3000, (1, 1, 1, 0, 1)),       # 活眠五
         (3000, (1, 1, 0, 1, 1)),       # 活眠五
         (3000, (1, 0, 1, 1, 1)),       # 活眠五
         (3500, (1, 1, 1, 1, 0)),       # 死四
         (3500, (0, 1, 1, 1, 1)),       # 死四
         (300000, (0, 1, 1, 1, 1, 0)),  # 活四
         (300000000, (1, 1, 1, 1, 1))]  # 活五
